# Системы счисления
# Система счисления — символический метод записи чисел, то есть представление чисел с помощью письменных знаков.
#     - число — некоторая абстрактная сущность, мера для описания количества чего-либо;
#     - цифра — знак, используемый для записи чисел.

# Цифры бывают разные, а самые распространенные — арабские цифры, представляемые знаками от нуля (0) до девяти (9);
# менее распространены римские цифры, их можно встретить на циферблате часов или в обозначении века (XIX век).

# Поскольку чисел гораздо больше, чем цифр, для записи числа обычно используется набор цифр. Только для самых малых по
# величине целых чисел достаточно одной цифры.

# Существует много способов записи чисел с помощью цифр, называемых системами счисления. Величина числа может зависеть
# от порядка цифр в записи, а может и не зависеть. Все системы счисления можно разделить на 4 основные группы:
#     - унарные;
#     - позиционные;
#     - непозиционные;
#     - смешанные.

# Унарные системы счисления
# В древние времена, когда люди начали считать, появилась потребность и записывать числа. Количество предметов
# изображалось черточками или насечками на какой-либо твердой поверхности: камне, дереве, глине. Позже значки стали
# группировать по три или по пять. Такая система записи чисел называется унарной (единичной), так как любое число в ней
# образуется путем повторения одного знака, символизирующего единицу. Отголоски унарной системы счисления встречаются и
# сегодня (счетные палочки для обучения счету; полоски, нашитые на рукаве и обозначающие на каком курсе учится курсант
# военного училища).

# Позиционные системы счисления
# В позиционных системах счисления значение цифры зависит от ее положения — позиции — в числе.
# Позиционные системы счисления позволяют легко производить арифметические расчеты.
# Представление чисел с помощью арабских цифр — самая распространенная позиционная система счисления, она называется
# десятичной системой счисления потому, что использует десять цифр: 0,1,2,3,4,5,6,7,8 и 9.

# Количество цифр, используемое в системе счисления, называется ее основанием. В десятичной системе основание равно
# десяти, в двоичной системе — двум, ну а в восьмеричной и шестнадцатеричной — соответственно, восьми и шестнадцати.

# Запомни: В позиционной системе счисления с основанием pp используются цифры от 0 до p-1.

# Непозиционные системы счисления
# В непозиционных системах счисления значение цифры не зависит от ее положения — позиции — в записанном числе.
# Примером непозиционной системы счисления является римская система (см. примечание).

# Запомни: при использовании непозиционных систем счисления очень сложно выполнять математические расчеты и  необходимо
# большое количество различных знаков для записи чисел, особенно больших.

# Смешанные системы счисления
# Смешанные системы счисления — это когда числа, заданные в системе счисления с основанием p изображают с помощью цифр
# другой системы, с основанием q, где q < p. Такая система называется q−p - ичной со старшим основанием p и младшим
# основанием q.

# Денежные знаки — пример смешанной системы счисления. Сейчас в России используются монеты и купюры следующих номиналов:
# по 1, 2, 5, 10, 50, 100, 200, 500, 1000, 2000, 5000 рублей и по 5, 10, 50 копеек. Чтобы получить некоторую сумму в
# рублях, нужно использовать некоторое количество денежных знаков различного достоинства. Таким образом, у этой системы
# целый ряд оснований, равный достоинствам денежных знаков, также используется основание той системы, с помощью которой
# производится их счет.

# Примечания
# Примечание 1.  Римская система счисления — непозиционная, в ней для записи чисел используются буквы латинского
# алфавита:
#     I — означает «один» (1);
#     V — означает «пять» (5);
#     X — означает «десять» (10);
#     L — означает «пятьдесят» (50);
#     C — означает «сто» (100);
#     D — означает «пятьсот» (500);
#     M — означает «тысяча» (1000).

# Для записи чисел в римской системе используются два правила:
#     каждый меньший знак, поставленный слева от большего, вычитается из него;
#     каждый меньший знак, поставленный справа от большего, прибавляется к нему.

# Примечание 2. Наиболее употребляемыми в настоящее время позиционными системами являются:
# 1 — единичная (счёт на пальцах, зарубки и др.);
# 2 — двоичная (в дискретной математике, информатике, программировании);
# 8 — восьмеричная;
# 10 — десятичная (используется повсеместно);
# 12 — двенадцатеричная (счёт дюжинами);
# 16 — шестнадцатеричная (используется в программировании, информатике).

# Примечание 3. Первая позиционная система счисления была придумана еще в Древнем Вавилоне, причем вавилонская нумерация
# была шестидесятеричная, т.е. в ней использовалось шестьдесят цифр. Мы до сих пор считаем, час – 60 минут,
# минута – 60 секунд, окружность – 360 градусов.

# Примечание 4. Для обозначения цифр в системах счисления с основанием больше 10 традиционно используются буквы
# английского алфавита — 10 = A, 11 = B, 12 = C, и так далее.


# Перевод чисел из любой системы счисления в десятичную
# Мы пользуемся свернутой формой записи числа, но мы знаем, что, например, десятичное число 352 = 3*100 + 5*10 + 2.
# В развернутой форме производится умножение цифр числа на степень основания, т.е. 352 = 3*10**2 + 5*10**1 + 2*10**0.
# То есть любое число в позиционной системе счисления можно записать в развернутой форме и перевести в десятичную
# систему счисления.

# Примеры
# Пример 1. Перевести двоичное число 110101(2) в десятичную систему счисления.
# Решение. Пронумеруем разряды двоичного числа справа налево начиная с нуля 110101(2) 6 разрадов от 0 до 5.
# Имеем 110101(2) = 1*2**5 + 1*2**4 + 0*2**3 + 1*2**2 + 0*2**1 + 1*2**0 = 53(10)

# В памяти компьютера числа представлены в двоичной системе счисления, поэтому в информатике часто возникает
# необходимость перевода чисел из двоичной системы в десятичную и обратно.

# Пример 2. Перевести число из четверичной системы счисления 3211(4) в десятичную систему счисления.
# Решение. Пронумеруем разряды четверичного числа справа налево начиная с нуля.
# Имеем 3211(4) = 3*4**3 + 2*4**2 + 1*4**1 + 1*4**0 = 3*64+1*4+1*1 = 229(10)

# Пример 3. Перевести число из восьмеричной системы счисления 214(8) в десятичную систему счисления.
# Решение. Пронумеруем разряды восьмеричного числа справа налево начиная с нуля.
# Имеем 214(8) = 2*8**2 + 1*8**2 + 4*8**0 = 128 + 8 + 4 = 140(10)

# Пример 4. Перевести число из шестнадцатеричной системы счисления 2AF(16) в десятичную систему счисления.
# Решение. Пронумеруем разряды шестнадцатеричного числа справа налево начиная с нуля.
# Имеем 2AF(16) = 2*16**2 + 10*16**1 + 15*16**0 = 2*256 + 10*16 + 15*1 = 687(10)


# Перевод чисел из десятичной системы счисления в любую другую
# Для перевода чисел из десятичной системы счисления в любую другую пользуются следующим алгоритмом:
#     - делим данное число на основание новой системы счисления и фиксируем целое частное и остаток от деления
#       (остаток всегда меньше основания);
#     - если полученное частное больше основания, то делим частное на основание и вновь фиксируем новое частное и
#       остаток от деления;
#     - повторяем этот процесс до тех пор, пока частное не получится меньше делителя, то есть основания новой системы
#       счисления;
#     - полученные остатки, являющиеся цифрами числа в новой системе счисления, приводим в соответствие с ее алфавитом;
#     - записываем последнее частное и полученные остатки в обратном порядке в ряд слева направо.

# Примеры
# Пример 1. Перевести десятичное число 25(10) в двоичную систему счисления.
# Решение. В соответствии с алгоритмом получаем: 25(10) = 11001(2)
#     25/2 = [1] 12/2 = [0] 6/2 = [0] 3/2 = [1] 1 (последнее частное)

# Пример 2. Перевести десятичное число 125(10) в восьмеричную систему счисления.
# Решение. В соответствии с алгоритмом получаем: 125(10) = 175(8)
#     125/8 = [5] 15/8 = [7] 1

# Пример 3. Перевести десятичное число 428(10) в шестнадцатеричную систему счисления.
# Решение. Так как в шестнадцатеричной системе счисления A=10, C=12, то в соответствии с алгоритмом получаем:
# 428(10) = 1AC(16)
#     428/16 = [12] 26/16 = [10] 1


# Двоичная, восьмеричная и шестнадцатеричная системы счисления
# В информатике и программировании часто используются двоичная, восьмеричная и шестнадцатеричная системы счисления.
# В Python встроены три функции bin(), oct(), hex(), которые возвращают строковые представления целого десятичного числа
# в соответствующей системе счисления (2, 8, 16).

# Функция bin()
# Функция bin() возвращает строку с двоичным представлением указанного целого числа.
print(bin(10))     # 0b1010
print(bin(128))    # 0b10000000
print(bin(150))    # 0b10010110
print(bin(18765))  # 0b100100101001101

# Важно: обратите внимание на приставку 0b, которая сигнализирует о том, что число представлено в двоичной системе
# счисления.

# Функция oct()
# Функция oct() возвращает строку с восьмеричным представлением указанного целого числа.
print(oct(10))     # 0o12
print(oct(128))    # 0o200
print(oct(150))    # 0o226
print(oct(18765))  # 0o44515

# Важно: обратите внимание на приставку 0o, которая сигнализирует о том, что число представлено в восьмеричной системе
# счисления.

# Функция hex()
# Функция hex() возвращает строку с шестнадцатеричным представлением указанного целого числа.
print(hex(10))      # 0xa
print(hex(128))     # 0x80
print(hex(150))     # 0x96
print(hex(18765))   # 0x494d

# Важно: обратите внимание на приставку 0x, которая сигнализирует о том, что число представлено в шестнадцатеричной
# системе счисления.

# Примечания
# Примечание 1. Если нам требуется избавиться от приставок 0b, 0o, 0x, то мы можем воспользоваться строковым срезом:
num = 127
bin_num = bin(num)  # 0b1111111
oct_num = oct(num)  # 0o177
hex_num = hex(num)  # 0x7f
print(bin_num[2:])  # 1111111
print(oct_num[2:])  # 177
print(hex_num[2:])  # 7f

# Примечание 2. Обратите внимание, что функция hex() возвращает шестнадцатеричное число с маленькими символами
# a, b, c, d, e, f. Для преобразования к верхнему регистру можно использовать строковый метод upper():
num = 127432
hex_num = hex(num)          # 0x1f1c8
print(hex_num[2:].upper())  # 1F1C8
